{
  "ua": "",
  "homeUrl": "https://gaze.run/",

  "homeVodNode": "//div[@id='portfolio']/div[contains(@class, 'container')]/div[contains(@class, 'row')][position() < 2]//div[@class='card']",
  "homeVodName": "//h6[contains(@class, 'card-title')]/text()",
  "homeVodId": "//a/@href",
  "homeVodIdR": "play/(.+)",
  "homeVodImg": "//img/@data-src",
  "homeVodMark": "//div[contains(@class, 'badge-danger')]/text()",

  "cateManual": {
    "电影": "1",
    "电视剧": "2",
    "番剧": "bangumi",
    "国漫": "chinese_cartoon"
  },

  "cateUrl": "https://gaze.run/filter_movielist",

  "dtUrl": "https://gaze.run/play/{vid}",
  "dtNode": "//head",
  "dtName": "/meta[@property='og:title']/@content",
  "dtImg": "/meta[@property='og:image']/@content",
  "dtCate": "/meta[@property='og:type']/@content",
  "dtArea": "/meta[@property='og:locale']/@content",
  "dtDesc": "/meta[@property='og:description']/@content",

  "searchUrl": "https://gaze.run/filter_movielist",
  "filter": {
    "1": [
      {
        "key": "tag_arr[]",
        "name": "类型",
        "value": [
          {
            "n": "全部",
            "v": "all"
          },
          {
            "n": "剧情",
            "v": "1"
          },
          {
            "n": "动作",
            "v": "2"
          },
          {
            "n": "喜剧",
            "v": "3"
          },
          {
            "n": "爱情",
            "v": "4"
          },
          {
            "n": "科幻",
            "v": "5"
          },
          {
            "n": "悬疑",
            "v": "6"
          },
          {
            "n": "惊悚",
            "v": "7"
          },
          {
            "n": "恐怖",
            "v": "8"
          },
          {
            "n": "犯罪",
            "v": "9"
          },
          {
            "n": "音乐",
            "v": "10"
          },
          {
            "n": "冒险",
            "v": "11"
          },
          {
            "n": "历史",
            "v": "12"
          },
          {
            "n": "战争",
            "v": "13"
          },
          {
            "n": "奇幻",
            "v": "14"
          },
          {
            "n": "黑帮",
            "v": "15"
          },
          {
            "n": "文艺",
            "v": "16"
          },
          {
            "n": "传记",
            "v": "17"
          },
          {
            "n": "运动",
            "v": "18"
          },
          {
            "n": "同性",
            "v": "19"
          },
          {
            "n": "情色",
            "v": "20"
          }
        ]
      },
      {
        "key": "mcountry",
        "name": "地区",
        "value": [
          {
            "n": "全部",
            "v": "all"
          },
          {
            "n": "中国大陆",
            "v": "1"
          },
          {
            "n": "中国台湾",
            "v": "2"
          },
          {
            "n": "中国香港",
            "v": "3"
          },
          {
            "n": "韩国",
            "v": "4"
          },
          {
            "n": "俄罗斯",
            "v": "5"
          },
          {
            "n": "美国",
            "v": "6"
          },
          {
            "n": "日本",
            "v": "7"
          },
          {
            "n": "印度",
            "v": "8"
          },
          {
            "n": "英国",
            "v": "9"
          },
          {
            "n": "德国",
            "v": "10"
          },
          {
            "n": "法国",
            "v": "11"
          },
          {
            "n": "意大利",
            "v": "12"
          },
          {
            "n": "泰国",
            "v": "13"
          },
          {
            "n": "爱沙尼亚",
            "v": "14"
          },
          {
            "n": "哈萨克斯坦",
            "v": "15"
          },
          {
            "n": "西班牙",
            "v": "16"
          },
          {
            "n": "黎巴嫩",
            "v": "17"
          },
          {
            "n": "巴西",
            "v": "18"
          },
          {
            "n": "澳大利亚",
            "v": "19"
          },
          {
            "n": "丹麦",
            "v": "20"
          },
          {
            "n": "瑞典",
            "v": "21"
          },
          {
            "n": "以色列",
            "v": "22"
          },
          {
            "n": "荷兰",
            "v": "23"
          },
          {
            "n": "伊朗",
            "v": "24"
          },
          {
            "n": "墨西哥",
            "v": "25"
          }
        ]
      },
      {
        "key": "sort",
        "name": "排序",
        "value": [
          {
            "n": "默认排序",
            "v": "default"
          },
          {
            "n": "评分排序",
            "v": "grade"
          },
          {
            "n": "名称排序",
            "v": "name"
          }
        ]
      }
    ],
    "2": [
      {
        "key": "tag_arr[]",
        "name": "类型",
        "value": [
          {
            "n": "全部",
            "v": "all"
          },
          {
            "n": "剧情",
            "v": "1"
          },
          {
            "n": "动作",
            "v": "2"
          },
          {
            "n": "喜剧",
            "v": "3"
          },
          {
            "n": "爱情",
            "v": "4"
          },
          {
            "n": "科幻",
            "v": "5"
          },
          {
            "n": "悬疑",
            "v": "6"
          },
          {
            "n": "惊悚",
            "v": "7"
          },
          {
            "n": "恐怖",
            "v": "8"
          },
          {
            "n": "犯罪",
            "v": "9"
          },
          {
            "n": "音乐",
            "v": "10"
          },
          {
            "n": "冒险",
            "v": "11"
          },
          {
            "n": "历史",
            "v": "12"
          },
          {
            "n": "战争",
            "v": "13"
          },
          {
            "n": "奇幻",
            "v": "14"
          },
          {
            "n": "黑帮",
            "v": "15"
          },
          {
            "n": "文艺",
            "v": "16"
          },
          {
            "n": "传记",
            "v": "17"
          },
          {
            "n": "运动",
            "v": "18"
          },
          {
            "n": "同性",
            "v": "19"
          },
          {
            "n": "情色",
            "v": "20"
          }
        ]
      },
      {
        "key": "mcountry",
        "name": "地区",
        "value": [
          {
            "n": "全部",
            "v": "all"
          },
          {
            "n": "中国大陆",
            "v": "1"
          },
          {
            "n": "中国台湾",
            "v": "2"
          },
          {
            "n": "中国香港",
            "v": "3"
          },
          {
            "n": "韩国",
            "v": "4"
          },
          {
            "n": "俄罗斯",
            "v": "5"
          },
          {
            "n": "美国",
            "v": "6"
          },
          {
            "n": "日本",
            "v": "7"
          },
          {
            "n": "印度",
            "v": "8"
          },
          {
            "n": "英国",
            "v": "9"
          },
          {
            "n": "德国",
            "v": "10"
          },
          {
            "n": "法国",
            "v": "11"
          },
          {
            "n": "意大利",
            "v": "12"
          },
          {
            "n": "泰国",
            "v": "13"
          },
          {
            "n": "爱沙尼亚",
            "v": "14"
          },
          {
            "n": "哈萨克斯坦",
            "v": "15"
          },
          {
            "n": "西班牙",
            "v": "16"
          },
          {
            "n": "黎巴嫩",
            "v": "17"
          },
          {
            "n": "巴西",
            "v": "18"
          },
          {
            "n": "澳大利亚",
            "v": "19"
          },
          {
            "n": "丹麦",
            "v": "20"
          },
          {
            "n": "瑞典",
            "v": "21"
          },
          {
            "n": "以色列",
            "v": "22"
          },
          {
            "n": "荷兰",
            "v": "23"
          },
          {
            "n": "伊朗",
            "v": "24"
          },
          {
            "n": "墨西哥",
            "v": "25"
          }
        ]
      },
      {
        "key": "sort",
        "name": "排序",
        "value": [
          {
            "n": "默认排序",
            "v": "default"
          },
          {
            "n": "评分排序",
            "v": "grade"
          },
          {
            "n": "名称排序",
            "v": "name"
          }
        ]
      }
    ],
    "bangumi": [
      {
        "key": "tag_arr[]",
        "name": "类型",
        "value": [
          {
            "n": "全部",
            "v": "all"
          },
          {
            "n": "剧情",
            "v": "1"
          },
          {
            "n": "动作",
            "v": "2"
          },
          {
            "n": "喜剧",
            "v": "3"
          },
          {
            "n": "爱情",
            "v": "4"
          },
          {
            "n": "科幻",
            "v": "5"
          },
          {
            "n": "悬疑",
            "v": "6"
          },
          {
            "n": "惊悚",
            "v": "7"
          },
          {
            "n": "恐怖",
            "v": "8"
          },
          {
            "n": "犯罪",
            "v": "9"
          },
          {
            "n": "音乐",
            "v": "10"
          },
          {
            "n": "冒险",
            "v": "11"
          },
          {
            "n": "历史",
            "v": "12"
          },
          {
            "n": "战争",
            "v": "13"
          },
          {
            "n": "奇幻",
            "v": "14"
          },
          {
            "n": "黑帮",
            "v": "15"
          },
          {
            "n": "文艺",
            "v": "16"
          },
          {
            "n": "传记",
            "v": "17"
          },
          {
            "n": "运动",
            "v": "18"
          },
          {
            "n": "同性",
            "v": "19"
          },
          {
            "n": "情色",
            "v": "20"
          }
        ]
      },
      {
        "key": "mcountry",
        "name": "地区",
        "value": [
          {
            "n": "全部",
            "v": "all"
          },
          {
            "n": "中国大陆",
            "v": "1"
          },
          {
            "n": "中国台湾",
            "v": "2"
          },
          {
            "n": "中国香港",
            "v": "3"
          },
          {
            "n": "韩国",
            "v": "4"
          },
          {
            "n": "俄罗斯",
            "v": "5"
          },
          {
            "n": "美国",
            "v": "6"
          },
          {
            "n": "日本",
            "v": "7"
          },
          {
            "n": "印度",
            "v": "8"
          },
          {
            "n": "英国",
            "v": "9"
          },
          {
            "n": "德国",
            "v": "10"
          },
          {
            "n": "法国",
            "v": "11"
          },
          {
            "n": "意大利",
            "v": "12"
          },
          {
            "n": "泰国",
            "v": "13"
          },
          {
            "n": "爱沙尼亚",
            "v": "14"
          },
          {
            "n": "哈萨克斯坦",
            "v": "15"
          },
          {
            "n": "西班牙",
            "v": "16"
          },
          {
            "n": "黎巴嫩",
            "v": "17"
          },
          {
            "n": "巴西",
            "v": "18"
          },
          {
            "n": "澳大利亚",
            "v": "19"
          },
          {
            "n": "丹麦",
            "v": "20"
          },
          {
            "n": "瑞典",
            "v": "21"
          },
          {
            "n": "以色列",
            "v": "22"
          },
          {
            "n": "荷兰",
            "v": "23"
          },
          {
            "n": "伊朗",
            "v": "24"
          },
          {
            "n": "墨西哥",
            "v": "25"
          }
        ]
      },
      {
        "key": "sort",
        "name": "排序",
        "value": [
          {
            "n": "默认排序",
            "v": "default"
          },
          {
            "n": "评分排序",
            "v": "grade"
          },
          {
            "n": "名称排序",
            "v": "name"
          }
        ]
      }
    ],
    "chinese_cartoon": [
      {
        "key": "tag_arr[]",
        "name": "类型",
        "value": [
          {
            "n": "全部",
            "v": "all"
          },
          {
            "n": "剧情",
            "v": "1"
          },
          {
            "n": "动作",
            "v": "2"
          },
          {
            "n": "喜剧",
            "v": "3"
          },
          {
            "n": "爱情",
            "v": "4"
          },
          {
            "n": "科幻",
            "v": "5"
          },
          {
            "n": "悬疑",
            "v": "6"
          },
          {
            "n": "惊悚",
            "v": "7"
          },
          {
            "n": "恐怖",
            "v": "8"
          },
          {
            "n": "犯罪",
            "v": "9"
          },
          {
            "n": "音乐",
            "v": "10"
          },
          {
            "n": "冒险",
            "v": "11"
          },
          {
            "n": "历史",
            "v": "12"
          },
          {
            "n": "战争",
            "v": "13"
          },
          {
            "n": "奇幻",
            "v": "14"
          },
          {
            "n": "黑帮",
            "v": "15"
          },
          {
            "n": "文艺",
            "v": "16"
          },
          {
            "n": "传记",
            "v": "17"
          },
          {
            "n": "运动",
            "v": "18"
          },
          {
            "n": "同性",
            "v": "19"
          },
          {
            "n": "情色",
            "v": "20"
          }
        ]
      },
      {
        "key": "mcountry",
        "name": "地区",
        "value": [
          {
            "n": "全部",
            "v": "all"
          },
          {
            "n": "中国大陆",
            "v": "1"
          },
          {
            "n": "中国台湾",
            "v": "2"
          },
          {
            "n": "中国香港",
            "v": "3"
          },
          {
            "n": "韩国",
            "v": "4"
          },
          {
            "n": "俄罗斯",
            "v": "5"
          },
          {
            "n": "美国",
            "v": "6"
          },
          {
            "n": "日本",
            "v": "7"
          },
          {
            "n": "印度",
            "v": "8"
          },
          {
            "n": "英国",
            "v": "9"
          },
          {
            "n": "德国",
            "v": "10"
          },
          {
            "n": "法国",
            "v": "11"
          },
          {
            "n": "意大利",
            "v": "12"
          },
          {
            "n": "泰国",
            "v": "13"
          },
          {
            "n": "爱沙尼亚",
            "v": "14"
          },
          {
            "n": "哈萨克斯坦",
            "v": "15"
          },
          {
            "n": "西班牙",
            "v": "16"
          },
          {
            "n": "黎巴嫩",
            "v": "17"
          },
          {
            "n": "巴西",
            "v": "18"
          },
          {
            "n": "澳大利亚",
            "v": "19"
          },
          {
            "n": "丹麦",
            "v": "20"
          },
          {
            "n": "瑞典",
            "v": "21"
          },
          {
            "n": "以色列",
            "v": "22"
          },
          {
            "n": "荷兰",
            "v": "23"
          },
          {
            "n": "伊朗",
            "v": "24"
          },
          {
            "n": "墨西哥",
            "v": "25"
          }
        ]
      },
      {
        "key": "sort",
        "name": "排序",
        "value": [
          {
            "n": "默认排序",
            "v": "default"
          },
          {
            "n": "评分排序",
            "v": "grade"
          },
          {
            "n": "名称排序",
            "v": "name"
          }
        ]
      }
    ]
  }
}